{
  "data": [
    {
      "id": 1,
      "title": "Point of Sale: The Meat Masters",
      "description": "I designed and implemented a customized Point of Sale (POS) system specifically tailored for 'The Meat Masters.' This comprehensive POS solution streamlines the ordering and payment processes, enhancing the customer experience and optimizing the business operations. The system features inventory management, sales reporting, and real-time transaction tracking. 'The Meat Masters' POS project demonstrates my expertise in software development, user interface design, and business efficiency improvement, showcasing my commitment to delivering solutions that elevate the retail experience.",
      "language": ["C#", "MySQL"],
      "image": [
        "./project/proj1/img1.png",
        "./project/proj1/img2.png",
        "./project/proj1/img3.png",
        "./project/proj1/img4.png",
        "./project/proj1/img5.png",
        "./project/proj1/img6.png",
        "./project/proj1/img7.png",
        "./project/proj1/img8.png",
        "./project/proj1/img9.png",  
        "./project/proj1/img10.png",
        "./project/proj1/img11.png",
        "./project/proj1/img12.png",
        "./project/proj1/img13.png",
        "./project/proj1/img14.png"
      ],
      "url": "",
      "video": "./project/proj1/vid.mp4",
      "type": "desktop"
    },
    {
      "id": 2,
      "title": "Reviewer Generator App",
      "description": "I conceived and developed a dynamic web-based Reviewer Generator App to simplify the creation of quizzes and study materials. This project exemplifies my proficiency in web application development and user interface design. The Reviewer Generator App provides an intuitive platform for educators and learners to generate custom quizzes, practice exams, and study guides. It reflects my commitment to enhancing learning experiences by delivering user-friendly, web-based tools for educational purposes.",
      "language": ["React"],
      "image": [],
      "url": "https://reviewergenerator.netlify.app",
      "url_label": "Example",
      "video": "",
      "type": "website"
    },
    {
      "id": 3,
      "title": "Attendance Management System",
      "description": "I conceptualized and developed an efficient and user-friendly Attendance Management System tailored to meet the needs of educational institutions and businesses alike. This system simplifies the process of recording and tracking attendance, automating routine tasks and providing real-time insights into attendance patterns. With features such as reporting, notifications, and easy integration with existing systems, this project demonstrates my expertise in software development, database management, and my commitment to streamlining attendance processes to improve productivity and accountability.",
      "language": ["C#", "MySQL"],
      "image": [
        "./project/proj2/img1.png",
        "./project/proj2/img2.png",
        "./project/proj2/img3.png",
        "./project/proj2/img4.png",
        "./project/proj2/img5.png",
        "./project/proj2/img6.png",
        "./project/proj2/img7.png",
        "./project/proj2/img8.png",
        "./project/proj2/img9.png",
        "./project/proj2/img10.png",
        "./project/proj2/img11.png",
        "./project/proj2/img12.png",
        "./project/proj2/img13.png",
        "./project/proj2/img14.png",
        "./project/proj2/img15.png"
      ],
      "url": "",
      "video": "./project/proj2/attendance.mp4",
      "type": "desktop"
    },
    {
      "id": 4,
      "title": "School Management System",
      "description": "I developed a robust School Management System to streamline administrative tasks and enhance efficiency within educational institutions. This system offers a comprehensive set of features, including student enrollment, attendance tracking, grade management, and communication tools for teachers, students, and parents. It has significantly reduced administrative overhead and improved communication between stakeholders, showcasing my skills in software development, database management, and a deep understanding of the education sector. The School Management System exemplifies my commitment to leveraging technology to solve real-world problems.",
      "language": ["Java", "MySQL"],
      "image": [
        "./project/proj3/img1.png",
        "./project/proj3/img2.png",
        "./project/proj3/img3.png",
        "./project/proj3/img4.png",
        "./project/proj3/img5.png",
        "./project/proj3/img6.png",
        "./project/proj3/img7.png"
      ],
      "url": "",
      "video": "./project/proj3/vid.MP4",
      "type": "desktop"
    },
    {
      "id": 5,
      "title": "Simple Shop Ordering System",
      "description": "I designed and developed a user-friendly shop ordering system in Java to enhance the customer experience. This application allows users to browse a catalog, customize orders, and complete secure transactions with ease. Real-time inventory tracking and order status updates were integrated to provide users with up-to-date information. The project reflects my skills in Java programming, user interface design, and database integration, showcasing my commitment to streamlining and simplifying the shopping process.",
      "language": ["Java", "MySQL"],
      "image": [
        "./project/proj4/img1.png",
        "./project/proj4/img2.png",
        "./project/proj4/img3.png",
        "./project/proj4/img4.png"
      ],
      "url": "",
      "video": "./project/proj4/shop_system.MP4",
      "type": "desktop"
    },
    {
      "id": 6,
      "title": "Portfolio Application",
      "description": "I conceived and created a comprehensive portfolio application designed to showcase my skills and achievements. This interactive platform not only presents a curated collection of my work but also offers visitors an immersive experience. The application demonstrates my proficiency in web development, user experience design, and content organization. It serves as a testament to my commitment to professional growth and the ability to present my portfolio in a dynamic and engaging manner.",
      "language": ["Java"],
      "image": [
        "./project/proj5/img1.jpg",
        "./project/proj5/img2.jpg",
        "./project/proj5/img3.jpg",
        "./project/proj5/img4.jpg",
        "./project/proj5/img5.jpg",
        "./project/proj5/img6.jpg"
      ],
      "url": "https://www.mediafire.com/file/hs7hleonj8ymv4q/exampleApp.apk/file",
      "url_label": "Download App",
      "video": "",
      "type": "mobile"
    },
    {
      "id": 7,
      "title": "ATM Card Generator.",
      "description": "I developed an innovative ATM Card Generator system designed to facilitate the quick and secure issuance of ATM cards within a banking environment. This project showcases my expertise in software development, database management, and security protocols. The ATM Card Generator streamlines the card issuance process, enhancing operational efficiency and ensuring a seamless experience for customers. It reflects my commitment to providing technology-driven solutions that improve operational processes and security in the banking industry.",
      "language": ["React"],
      "image": [],
      "url": "https://atm-card-generators.netlify.app/",
      "url_label": "Example",
      "video": "",
      "type": "website"
    },
    {
      "id": 8,
      "title": "Typing Speed App",
      "description": "I conceptualized and developed an interactive Typing Speed App, accessible via web browsers, to empower users in improving their typing skills and boosting their words per minute (WPM). This project underscores my expertise in web application development and user experience design. The Typing Speed App offers engaging typing exercises, real-time performance assessment, and a user-friendly interface, enhancing users' typing proficiency. It reflects my commitment to delivering web-based solutions that promote skill development and efficiency.",
      "language": ["React", "MySQL"],
      "image": [],
      "url": "https://keyboardapps.netlify.app",
      "url_label": "Example",
      "video": "",
      "type": "website"
    },
    {
      "id": 9,
      "title": "Functional Calculator",
      "description": "I created a versatile web-based Functional Calculator that provides users with a powerful and user-friendly tool for various mathematical calculations. This project showcases my expertise in web development and user interface design. The Functional Calculator offers a wide range of mathematical functions, real-time results, and a clean, intuitive interface. It reflects my commitment to delivering efficient and accessible web-based tools to assist users in their daily computational needs.",
      "language": ["HTML", "CSS", "Javascript"],
      "image": [],
      "url": "https://ronaldgulayan.github.io/Calculator/calculator/",
      "url_label": "Example",
      "video": "",
      "type": "website"
    },
    {
      "id": 10,
      "title": "Sample Comment Box",
      "description": "I designed and developed a simple yet effective web-based Sample Comment Box, which can be integrated into websites and applications to enable user interactions. This project demonstrates my skills in web development and user interface design. The Sample Comment Box provides a seamless way for users to leave comments, feedback, or engage in discussions on web platforms. It reflects my commitment to creating user-friendly web components that foster online engagement and communication.",
      "language": ["HTML", "CSS", "Javascript", "PHP", "MySQL"],
      "image": [],
      "url": "https://gcst.000webhostapp.com/",
      "url_label": "Example",
      "video": "",
      "type": "website"
    },
    {
      "id": 11,
      "title": "Online Appointment System",
      "description": "I designed and developed a simple yet effective web-based Online Appointment System that enables users to schedule, view, and manage appointments efficiently. This project showcases essential web development skills such as form handling, database integration, real-time updates, and user authentication. Built using technologies like HTML, CSS, JavaScript, and a backend framework, the system streamlines the booking process while demonstrating core functionalities such as CRUD operations, calendar-based scheduling, and automated confirmation notifications.",
      "image": [],
      "language": ["HTML", "CSS", "Javascript", "Supabase", "React"],
      "url": "https://granbyappointment.netlify.app/",
      "url_label": "Go to appointment system",
      "video": "",
      "type": "website"
    }
  ]
}